<?php

/** @var \Illuminate\Database\Eloquent\Factory $factory */

use App\Announcement;
use App\Major;
use App\User;
use Illuminate\Support\Str;
use Faker\Generator as Faker;

/*
|--------------------------------------------------------------------------
| Model Factories
|--------------------------------------------------------------------------
|
| This directory should contain each of the model factory definitions for
| your application. Factories provide a convenient way to generate new
| model instances for testing / seeding your application's database.
|
*/
//
//$factory->define(User::class, function (Faker $faker) {
//    return [
//        'name' => $faker->name,
//        'email' => $faker->unique()->safeEmail,
//        'email_verified_at' => now(),
//        'password' => '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', // password
//        'remember_token' => Str::random(10),
//    ];
//});
//
//$factory->define(Announcement::class, function (Faker $faker){
//    return [
//       'title' => $faker->sentence,
//        'body'=> $faker->paragraph
//    ];
//});
//
//$factory->define(Major::class, function (Faker $faker){
//    return [
//        'major_code' => $faker->numberBetween(11111111, 99999999),
//        'location_code' => $faker->numberBetween(11111111, 99999999),
//        'major_name' => $faker->sentence(5),
//        'location_name' => $faker->sentence(5),
//    ];
//});
//
//$adabiat_o_ensani = "مهندسی برق – دبیر فنی برق – مهندسی دریا – مهندسی صنایع – مهندسی عمران – دبیر فنی عمران – مهندسی راه آهن – مهندسی ماشینهای ریلی – مهندسی کامپیوتر – مهندسی رباتیک – مهندسی معدن – رشته مهندسی مکانیک – مهندسی بیوسیستم (مکانیک ماشینهای کشاورزی) – دبیر فنی مکانیک – مهندسی مواد – مهندسی نساجی – مهندسی هوافضا مهندسی نگهداری هواپیما رشته هوانورد – مراقبت پرواز – مهندسی معماری – کاردانی معماری – کاردانی معماری سنتی – رشته ریاضی – رشته دبیری ریاضی – رشته فیزیک – رشته دبیری فیزیک – رشته آمار -رشته کاردانی آمار – کاردانی کامپوتر (سخت‌افزار) – کاردانی کامپوتر (نرم‌افزار) – تکنولوژی ماشینهای کشاورزی – مهندسی کشاورزی – مهندسی عمران روستایی – مهندسی دریایی – کاردانی الکترونیک صدا و سیما – کاردانی دریا نوردی – معلم فنی مکانیک – تعمیر و نگهداری هواپیما – کاردان فنی کشتی – کاردان فنی حفاری کاردان فنی مکانیک – تکنولوژی  آبیاری – کاردان فنی نساجی – معلم فنی معماری – مهندسی پزشکی – مهندسی حمل و نقل ریلی – مهندسی خط و سازه‌های ریلی -مهندسی ماشینهای ریلی – کارشناسی حسابداری – مدیریت کمیسر دریایی – مدیریت و بازرگانی دریایی – کاردانی تسلیحات – کاردانی تکنیک خودروهای نظامی – علوم کامپیوتر – مهندسی شهر سازی – معلم فنی برق – کاردانی فنی برق الکترونیک دریایی – کاردان فنی برق مخابرات دریایی – مهندسی فرماندهی و کنترل هواپیمایی – معلم فنی برق – تربیت دبیر فنی عمران –  مهندسی مخابرات – مهندسی هوانوردی – کاردانی تکنولوژی هسته ای – علوم و فنون هوانوردی – رشته خلبانی هلیکوپتری – مهندسی نگهداری – مهندسی سیستم – مهندسی الکترونیک و مخابرات دریایی – ناوبری و فرماندهی کشتی – کاردانی اویونیک هواپیما – مهندسی پلیمر – مهندسی شیمی – طراحی و مهندسی پتروشیمی – مهندسی عملیات و صنایع پتروشیمی – طراحی و مهندسی پلیمر – مهندسی ایمنی و حفاظت – مهندسی ایمنی و بازرسی فنی – مهندسی نفت – مهندسی اکتشافات نفت – رشته شیمی – رشته کاردان فنی برق -رشته کاردان فنی شیمی – رشته معلم فنی صنایع شیمیایی – رشته کاردانی فنی صنایع غذایی – رشته کاردانی ایمنی صنعتی – رشته معلم فنی صنایع چوب – الکترونیک هواپیمایی – مخابرات هواپیمایی – معلم فنی مواد – رشته کاردان صنایع چوب – کاردانی علمی – کاربردی صنایع چوب – کاردانی استخراج معادن غیر زغال سنگ – رشته کاردان فنی عملیات پتروشیمی – معلم فنی عمران – کاردانی علمی – کاربردی چاپ – کاردانی شیمی مواد پرانرژی – مهندسی علوم آب – کانی آرایی لیست رشته های گروه ادبیات و علوم انسانی رشته زبان و ادبیات فارسی – رشته دبیری زبان و ادبیات فارسی – رشته زبان و ادبیات عرب – رشته دبیر زبان و ادبیات عرب – رشته مترجمی زبان عربی – رشته ادبیات و زبان عربی – رشته الهیات و معارف اسلامی -رشته دبیری الهیات و معارف اسلامی – رشته دبیری علوم دینی – رشته کارشناسی تربیت مربی عقیدتی و سیاسی – رشته کاردانی تربیت معلم قرآن – رشته علوم قرآنی – رشته علوم اسلامی – رشته الهیات – رشته معارف اسلامی و ارشاد – رشته معارف اسلامی و حقوق – رشته علوم دینی و معارف اسلامی – رشته علوم قرآن و حدیث – رشته معارف اسلامی و علوم سیاسی – رشته معارف اسلامی و الهیات – رشته مدرسی معارف اسلامی – رشته حقوق – رشته علوم قضایی – رشته فقه و حقوق اسلامی – رشته فقه و حقوق حنفی – رشته فقه و حقوق امامی – رشته فقه و حقوق شافعی – رشته کارشناسی فقه – رشته کاردانی امور حقوقی و کنسولی – رشته پلیس قضایی – رشته حکمت اسلامی و فلسفه – رشته فلسفه – رشته علوم اجتماعی – رشته دبیری علوم اجتماعی – رشته علوم ارتباطات اجتماعی – رشته مددکاری اجتماعی -رشته خبرنگاری – رشته علوم اقتصادی –  رشته اقتصاد صنعتی  – رشته اقتصاد حمل و نقل – رشته حسابداری – رشته کاردانی امور مالی و مالیاتی – رشته امور گمرکی – رشته بانکداری – رشته امور بانکی -رشته صنایع چاپ – رشته مدیریت – رشته مدیریت دولتی – رشته مدیریت جهانگردی – رشته مدیریت امور گمرکی – رشته مدیریت مسافرتی و جهانگردی – رشته مدیریت صنعتی – رشته مدیریت بیمه – رشته کاردانی امور بیمه – رشته مدیریت بیمه اکو – رشته خدمات امور اداری – رشته مدیریت امور بانکی – رشته مدیریت و کمیسر دریایی – رشته مدیریت و بازرگانی دریایی – رشته مدیریت فرهنگی و هنری – رشته کارشناسی خبرنگاری – رشته کاردانی امور دفتری – رشته کارشناسی تولید سیما – رشته مدیریت بانکداری – رشته علوم سیاسی – رشته روابط سیاسی – رشته علوم سیاسی (امنیت ملی) – رشته کاردانی عملیات کشوری – رشته اطلاعات نظامی – رشته علوم انتظامی – رشته اطلاعات و ضد اطلاعات – رشته جغرافیای سیاسی – رشته جغرافیا – رشته تاریخ – رشته باستانشناسی – رشته آمار – رشته روانشناسی – رشته علوم تربیتی – رشته راهنمایی و مشاوره – رشته مطالعات خانواده- رشته کتابداری – رشته دبیری تربیت بدنی و علوم ورزشی";
//$clear_text_adabiat_o_ensani = str_replace('رشته ', '', $adabiat_o_ensani);
//
//$majors = explode('–',$clear_text_adabiat_o_ensani);
//
//foreach ($majors as $major){
//    $province = \App\Province::all()->random(1)->first()->name;
//
//    \App\Major::create([
//        'major_name' => $major,
//        'major_code' => random_int(2222222222,9999999999),
//        'location_name' => $province,
//        'location_code' => random_int(2222222222,9999999999),
//    ]);
//}

$factory->define(\App\Invoice::class, function (Faker $faker) {
    return [
        'invoice_code' => $faker->name,
        'title' => $faker->name,
        'description' => $faker->name,
    ];
});
